In [1]:
# 本节讲的主要是数据转换相关的工作
# 合并数据集
import numpy as np
import pandas as pd
from pandas import DataFrame
from pandas import Series

In [2]:
# 一、移除重复数据
data = DataFrame({'k1':['one'] * 3+ ['two'] *4,
                  'k2':[1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [3]:
data.duplicated() # DataFrame的duplicated方法返回一个布尔型Series、表示各行是否是重复行：默认会判断全部列

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [4]:
data.drop_duplicates()  # 用于返回一个移除了重复行的DataFrame,默认会判断全部列

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [5]:
data['v1'] = range(7) 
print(data)
data.drop_duplicates(['k1'])  #  可以以列表的形式，传入参数，指定部分列进行重复项判断

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

    k1  k2  v1
0  one   1   0
3  two   3   3

In [8]:
# drop_duplicates函数和duplicated函数都是默认保留的第一个出现的值的组合，即参数取值为take_last=False
data.drop_duplicates(['k1', 'k2'],keep='last')

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

In [ ]:
# 二、利用函数或映射进行数据转换
# 可能会有根据数组、Series或Dataframe列中的值来实现该转换工作

In [9]:
data = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef',
                          'Bacon', 'pastrami', 'honey ham', 'nova lox'],
                  'ounces':[4, 3, 12, 6, 7.5, 8, 3, 5,6]
    
                  })
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [10]:
# 要根据映射来添加一列来表示该肉类食物来源的动物类型
meat_to_animal = { 'bacon':'pig','pulled pork':'pig','pastrami':'cow','corned beef':'cow',
                  'honey ham':'pig','nova lox':'salmon'}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [ ]:
# 首先将data的各个值先转为小写